giangalv/EMBEDDED_SYSTEMS/B_dsPIC33EP512MU810/prova_UART.c
int extract_integer(const char* str) { 
  int i = 0, number = 0, sign = 1;

  if (str[i] == '-') {
    sign = -1;
    i++;
  }
  else if (str[i] == '+') {
    sign = 1;
    i++;
  }
  while (str[i] != ',' && str[i] != '\0'){
    number = number * 10;
    number += str[i] - '0';
    i++;
  }
  return sign * number;
}

int next_value(const char* msg, int i) {
  while (msg[i] != ',' && msg[i] != '\0') {
    i++;
  }
  if (msg[i] == ',') {
    i++;
  }
  return i;
}

void parse_pcth(const char* msg){
  int i = 0;
  threshold.minth = extract_integer(msg);
  i = next_value(msg, i);
  threshold.maxth = extract_integer(msg + i);
}

///////////////////////// INTERRUPT FUNCTIONS /////////////////////////
void __attribute__((__interrupt__, __auto_psv__)) _INT1Interrupt(){
    /*
     * Interrupt function for button E8 (INT1): Resets the interrupt flag, 
     * disables INT1 interrupt, enables Timer1 (T1IE) interrupt, resets T1IF flag,
     * clears Timer1 register, and starts Timer1.
     */ 
    IFS1bits.INT1IF = 0;    // Reset INT1 interrupt flag 
    IEC1bits.INT1IE = 0;    // Disable INT1 interrupt for button S5
    IEC0bits.T1IE = 1;      // Enable Timer1 (T1IE) interrupt
    IFS0bits.T1IF = 0;      // Reset Timer1 interrupt flag
    TMR1 = 0;               // Clear Timer1 'counter' register
    T1CONbits.TON = 1;      // Start Timer1
}

void __attribute__ ((__interrupt__, __auto_psv__)) _T1Interrupt(){
    /*
     * Timer1 (T1) interrupt function: Resets the Timer1 interrupt flag,
     * disables Timer1 interrupt (T1IE), enables INT1 interrupt for button E8,
     * and checks if button E8 is pressed. If it is pressed, it stops the motion.
     */ 
    IFS0bits.T1IF = 0;      // Reset Timer1 interrupt flag 
    IEC0bits.T1IE = 0;      // Disable Timer1 interrupt
    IFS1bits.INT1IF = 0;    // Reset INT1 interrupt flag
    IEC1bits.INT1IE = 1;    // Enable INT1 interrupt for button S5

    // Check if button E8 is already pressed
    if(PORTEbits.RE8 == 0){
        if (mainState == STATE_WAIT){
            mainState = STATE_MOTION;
        }
        else if (mainState == STATE_MOTION){
            mainState = STATE_WAIT;
        }
        // stop the timer3
        T3CONbits.TON = 0; 
        TMR3 = 0.0;
        counterBlink = 0;
        // turn off the lights
        lights_off();
    }
}

void __attribute__ ((__interrupt__, __auto_psv__)) _T3Interrupt(){
    /*
    * Timer3 (T3) interrupt function: Resets the Timer3 interrupt flag,
    * implements the variable 'counterBlink' because we cannot have a timer with a period of 1 second,
    * so we wait two times the interrupt period (500ms) to have a period of 1 second. 
    * After that, we blink the lights at 1Hz.
    */
    IFS0bits.T3IF = 0;      // Reset Timer3 interrupt flag
    TMR3 = 0.0;
    counterBlink += 1;
    if (counterBlink == 5 && mainState == STATE_WAIT){
        // blink the lights at 1Hz
        LATGbits.LATG9 = !LATGbits.LATG9;
        LATAbits.LATA0 = !LATAbits.LATA0;
        LATBbits.LATB8 = !LATBbits.LATB8; // LEFT
        LATFbits.LATF1 = !LATFbits.LATF1; // RIGHT
        counterBlink = 0;
        return;
    }
    else if (counterBlink == 5 && mainState == STATE_MOTION){
        // blink the right side lights at 1Hz
        LATFbits.LATF1 = !LATFbits.LATF1;
        counterBlink = 0;
        return;
    }
    T3CONbits.TON = 1; // start the timer
}

void __attribute__ ((__interrupt__, __auto_psv__)) _T4Interrupt(){
    IFS1bits.T4IF = 0;      // Reset Timer4 interrupt flag
    TMR4 = 0.0;
    hz10 = 1;
    T4CONbits.TON = 1;      // start the timer
}

void lights_off(){
    LATAbits.LATA0 = 0; 
    LATGbits.LATG9 = 0; 
    LATBbits.LATB8 = 0; 
    LATFbits.LATF1 = 0; 
    LATFbits.LATF0 = 0; 
    LATGbits.LATG1 = 0; 
    LATAbits.LATA7 = 0;
}

void push(char receivedChar, bool bufferSelection) {
    /*
     * Pushes characters received from UART into the circular buffer.
     * As we have two circular buffers, we have to select which one we want to use with the boolean 'bufferSelection'.
     * If the buffer is full, we don't push other characters.
     */
    if (bufferSelection == true){
        if (cb_reception.bufferLength == SIZE_OF_BUFFER_RC) {
            return;
        } 
        else {
            cb_reception.buffer[cb_reception.writeIndex] = receivedChar;
            cb_reception.bufferLength++;
            cb_reception.writeIndex++;
            // Wrap around if the writeIndex exceeds the buffer size
            if (cb_reception.writeIndex == SIZE_OF_BUFFER_RC) {
                cb_reception.writeIndex = 0;
            }
        }
    }
    else if (bufferSelection == false){ 
        if (cb_transmission.bufferLength == SIZE_OF_BUFFER_TR) {
            return;
        } 
        else {
            cb_transmission.buffer[cb_transmission.writeIndex] = receivedChar;
            cb_transmission.bufferLength++;
            cb_transmission.writeIndex++;
            // Wrap around if the writeIndex exceeds the buffer size
            if (cb_transmission.writeIndex == SIZE_OF_BUFFER_TR) {
                cb_transmission.writeIndex = 0;
            }
        }
    }

}


void pull(bool bufferSelection) {
    /*
     * Takes out all characters from the circular buffers:
     * as we have two circular buffers, we have to select which one we want to use with the boolean 'bufferSelection'.
     * With the 'cb_reception' buffer, we parse the message (with 'parse_byte') and we acquire the payload (with 'parse_pcth') into sdata.minth and maxth.
     * With the 'cb_transmission' buffer, we send the data to the UART.
     */
    if (bufferSelection == true){
        while (cb_reception.bufferLength > 0) {
            if (cb_reception.bufferLength == 0) {
                return;
            } 
            else {
                IEC1bits.U2RXIE = 0; // Disable UART2 Receiver Interrupt to avoid problems with shared variables  
                char receivedChar = cb_reception.buffer[cb_reception.readIndex];
                cb_reception.bufferLength--;
                cb_reception.readIndex++;
                // Wrap around if the readIndex exceeds the buffer size
                if (cb_reception.readIndex == SIZE_OF_BUFFER_RC) {
                    cb_reception.readIndex = 0;
                }
                int msg_result = parse_byte(&ps, receivedChar); // Parse the byte to get the message type
                IEC1bits.U2RXIE = 1; // Enable UART2 Receiver Interrupt
                if (msg_result == NEW_MESSAGE) { // If we have a new message, we acquire the payload into sdata.minth and maxth
                    if (ps.msg_type[0] == 'P' && ps.msg_type[1] == 'C' && ps.msg_type[2] == 'T' && ps.msg_type[3] == 'H' && ps.msg_type[4] == '\0'){
                        parse_pcth(ps.msg_payload);
                    }
                }
            }
        }
    }
    else if (bufferSelection == false){ 
        if (cb_transmission.bufferLength <= 0) {
            return;
        } 
        else {
            //IEC1bits.U2RXIE = 0; // Disable UART2 Receiver Interrupt to avoid problems with shared variables  
            char receivedChar = cb_transmission.buffer[cb_transmission.readIndex];
            cb_transmission.bufferLength--;
            cb_transmission.readIndex++;
            // Wrap around if the readIndex exceeds the buffer size
            if (cb_transmission.readIndex == SIZE_OF_BUFFER_TR) {
                cb_transmission.readIndex = 0;
            }
            //IEC1bits.U2RXIE = 1; // Enable UART2 Receiver Interrupt
            // If the buffer is not full, send the data
            U2TXREG = receivedChar;
        }
    }
}

void PWM_initialization(){
    // Configuration for the PWM
    PTCONbits.PTEN = 1; // Enable the PWM
    // Set the input clock source for the OCx module
    // Set the OCx module to operate timer output compare mode
    OC1CON1bits.OCM = 6; // PWM mode on OC1; Fault pin disabled
    OC2CON1bits.OCM = 6; 
    OC3CON1bits.OCM = 6;
    OC4CON1bits.OCM = 6;
    // Set the OCx module synchronization source to the peripheral timer
    OC1CON2bits.SYNCSEL = 0x1F; // Use the peripheral clock (maxVelocityValue) instead of the timer2 (default)
    OC2CON2bits.SYNCSEL = 0x1F;
    OC3CON2bits.SYNCSEL = 0x1F;
    OC4CON2bits.SYNCSEL = 0x1F;
    // Set pin for the CONTROL of the MOTORS
    RPOR0bits.RP65R = 0x010; // Set pin RP65 as OC1 (PWM)
    RPOR1bits.RP66R = 0x011; // Set pin RP66 as OC2 (PWM)
    RPOR1bits.RP67R = 0x012; // Set pin RP67 as OC3 (PWM)
    RPOR2bits.RP68R = 0x013; // Set pin RP68 as OC4 (PWM)
    // Set the PWM frequency from 0 to 10kHz
    OC1RS = 14400; 
    OC2RS = 14400; 
    OC3RS = 14400; 
    OC4RS = 14400; 
    stop_motion(); // Stop the motion
}


// INTERRUPT UART
void __attribute__((__interrupt__, __auto_psv__)) _U2RXInterrupt
    () {
    /*
     * Interrupt function of the UART2: when the buffer is full, execute it.
     * Read the buffer and push the data inside the circular buffer
     */ 
    IFS1bits.U2RXIF = 0;                          // Reset the flag
    if(U2STAbits.URXDA == 1){                     // If there are data to be read
        //IEC1bits.U2RXIE = 0;                      // Disable interrupt for UART2 reception
        char receivedData = U2RXREG;              // Read
        push(receivedData, true);                       // Push
        //IEC1bits.U2RXIE = 1;                       // Push
    }    
}

// Function to calculate the threshold based on our empirical data..
float threshold_calculation(float y_cm){
    float threshold = (float) ((0.016 * y_cm) - 0.025);
    return threshold;
}

void motor_pwm(float y){
    /*
    * Function to calculate the duty cycle for the motors based on the distance acquired from the ADC sensor
    * and the threshold calculated from the empirical data. The duty cycle is calculated as a percentage of the
    * maximum velocity (14400) and then it is applied to the PWM. The function returns the duty cycle for the motors.
    * The function also sets the lights based on the distance acquired from the ADC sensor. 
    * The maximum velocity is set to 60% of the maximum velocity (14400) because we want to have a margin of error.
    * The maxVelocityValue is set to 14400 because we want to have a period of 10kHz for the PWM.
    */
    int maxVelocityValue = 14400;        // 10kHz
    int maxVel = maxVelocityValue * 0.6; // 60% of the max velocity
    int minVel = maxVelocityValue * 0.4; // 40% of the max velocity
    int left_pwm1, right_pwm1, left_pwm2, right_pwm2; // Duty cycle for the motors
    float MIN = threshold_calculation(threshold.minth); // 15cm -> ~0.2
    float MAX = threshold_calculation(threshold.maxth); // 38cm -> ~0.6
    float sg, yr = 0.0; // Variables to set the lights based on the distance acquired from the ADC sensor
    // Check if the distance is in the desired range
    if (y < MIN){  // Pure right rotation
        sg = 0;  
        yr = 100;  
        left_pwm1 = maxVel;
        right_pwm1 = 0;
        left_pwm2 = 0;
        right_pwm2 = maxVel;
       // lights_motion(sg, yr); // Set the lights
    }
    else if (y > MAX){ // Move forward
        sg = 100;
        yr = 0;
        left_pwm1 = maxVel;
        right_pwm1 = maxVel;
        left_pwm2 = 0;
        right_pwm2 = 0;
        //lights_motion(sg, yr); // Set the lights
    }
    else if (y <= MAX && y >= MIN){ // Turn right
        sg = (int) (100*(y-MIN)/(MAX-MIN)); 
        yr = (int) (100*(MAX-y)/(MAX-MIN)); 
        // Linear velocity decrease and dependant on the distance
        left_pwm1 = (int) (sg*minVel/100);  
        right_pwm1 = (int) (sg*minVel/100); 
        left_pwm2 = 0;
        right_pwm2 = 0;
        // Create an angolar velocity to turn right
        if (yr > 50){
            // Set the linear velocity to 50% of the before calculated value
            left_pwm1 = (int) (minVel*0.5);
            right_pwm1 = (int) (minVel*0.5);
            // Add the angolar velocity to turn right
            left_pwm1 = (int) (left_pwm1 + (yr-50)*minVel/100);
            right_pwm1 = (int) (right_pwm1 - (yr-50)*minVel/100);
        }
       // lights_motion(sg, yr); // Set the lights
    }
    else{ // If there is an error stop the motion
        stop_motion();
       // lights_off();
        return;
    }
    // Set the duty cycle for the motors
    OC2R  = left_pwm1;
    OC4R  = right_pwm1;
    OC1R  = left_pwm2;
    OC3R  = right_pwm2;
    return;
}

void stop_motion(){
    // Stop the motion
    OC2R = 0;
    OC4R = 0;
    OC1R = 0;
    OC3R = 0;
}

// ADC FUNCTIONS //

float acquisition_ADC(bool flag_mes){
    /*
    * Function to acquire the data from the ADC sensor and calculate the distance and the battery voltage
    * The ADC is triggered to sample the data and when the conversion is done, the data are stored in the ADC1BUF0 and ADC1BUF1
    */
    do {
        if (AD1CON1bits.SAMP == 0)
            AD1CON1bits.SAMP = 1;                                   // Start sampling again
    } while (!AD1CON1bits.DONE);                                    // Wait for the conversion to complete
    if (flag_mes == true){
        float V = (float) ADC1BUF1*(3.3 - 0)/1024;                      // Calculate the voltage of the sensor
        float y = 2.34 - (float) 4.74*V + (float) 4.06*pow(V,2) - (float) 1.60*pow(V,3) + (float) 0.24*pow(V,4);  // Use the formula given in the datasheet to calculate the distance
        float battery = (float) 3*ADC1BUF0*(3.3 - 0)/1024;             // Calculate the battery voltage
        return y;
    }
    else if (flag_mes == false){
        //float battery = 2.2;
        float battery = (float) 3*ADC1BUF0*(3.3 - 0)/1024;             // Calculate the battery voltage
        return battery;
    }
}

