giangalv/EMBEDDED_SYSTEMS/B_dsPIC33EP512MU810/prova_UART.c
void send_battery_voltage(float* v_battery){
    // Function to send the battery voltage to the UART
    int size = 13;
    char message[size];
    float battery = (float) 3*ADC1BUF0*(3.3 - 0)/1024;
    sprintf(message, "$MBATT,%.2f*", battery);
    char ch = ' ';

    for (int i = 0; i < size && message[i] != '\0'; i++){ 
        ch = message[i];
        push(ch, false);
    }
}

int inverse_threshold_calculation(float threshold){
    int y_cm = (int) ((threshold + 0.025)/0.016);
    return y_cm;
}

void send_distance(int* cm_distance){
    // Function to send the distance to the UART
    int size = 12;
    char message[size];
    sprintf(message, "$MDIST,%d*",*cm_distance);
    char ch = ' ';
    for (int i = 0; i < size && message[i] != '\0'; i++){ 
        ch = message[i];
        push(ch, false);
    }
}

void send_duty_cycle(){
    // Function to send the duty cycle to the UART
    int size = 25;
    char message[size];
    sprintf(message, "$MDUTY,%d,%d,%d,%d*", OC1R, OC2R, OC3R, OC4R);
    char ch = ' ';
    for (int i = 0; i < size && message[i] != '\0'; i++){ 
        ch = message[i];
        push(ch, false);
    }
}

int main(void){
    ANSELA=ANSELB=ANSELC=ANSELD=ANSELE=ANSELG=0x0000; //MANDATORY 

    // initializations
    leds_initialization();
    bottoms_initialization();   
    ADC_initialization();
    buffers_initialization();
    PWM_initialization();

    
    // UART2 initialization
    // UART2 TX and RX pins

    U2MODE = 0; // Clear UART2 mode register
    U2STA = 0; // Clear UART2 status register
    U2BRG = 157; // 28800 baud rate
    U2MODEbits.UARTEN = 1; // Enable UART2
    U2STAbits.UTXEN = 1; // Enable UART2 transmission
    U2STAbits.URXISEL = 3; // Interrup when the buffer is full
    IEC1bits.U2RXIE = 1; // Enable UART2 interrupt
    U2STAbits.UTXISEL0 = 0; // Interrupt when the buffer is empty
    U2STAbits.UTXISEL1 = 0; // Interrupt when the buffer is empty
    RPOR0bits.RP64R = 0x03; // Set pin RP64 as U2TX
    RPINR19bits.U2RXR = 0x4B; // Set pin RP75 as U2RX

    // set the timer for the main at 1kHz
    tmr_setup_period(TIMER2, 1); // set the timer to 1ms
    // set the timer for the blink at 1Hz (200ms x 5 = 1s)
    tmr_setup_period(TIMER3, 200); // set the timer to 200ms
    IEC0bits.T3IE = 1; // Enable Timer3 (T3IE) interrupt
    // set timer4 at 10 Hz
    tmr_setup_period(TIMER4, 100); // set the timer to 100ms
    IEC1bits.T4IE = 1; // Enable Timer4 (T4IE) interrupt

    float distance = 0.0;
    
    // Parser state initialization:
    ps.state = STATE_DOLLAR; 
    ps.index_type = 0; 
    ps.index_payload = 0;

    // Battery voltage initialization:
    float battery = 0.0;
    int count, dc1, dc2, dc3, dc4 = 0000;
    
    // Threshold data initialization:
    threshold.minth = 15; 
    threshold.maxth = 38;

    IFS1bits.T4IF = 0;        
    T4CONbits.TON = 1;
    
    while (1)
    {
        distance = acquisition_ADC(true);
        motor_pwm(distance);        

        // Check if there are characters in UART2 buffer
        if (U2STAbits.URXDA == 1) {   
            IEC1bits.U2RXIE = 0;         // Disable interrupt for UART2 reception
            char receivedData = U2RXREG; // Read from UART2
            push(receivedData, true);   
            IEC1bits.U2RXIE = 1;         // Enable UART2 reception interrupt
        }
        pull(true);

        // trasmission of the data
        if(hz10 == 1){ //10Hz - 100ms Tasks
            count++;
            /*
            int distance_cm = inverse_threshold_calculation(distance);
            send_distance(&distance_cm);
            hz10 = 0; // Re-set the flag
            */
            send_duty_cycle();           
            hz10 = 0; // Re-set the flag
            
            if (count % 10 == 0){
                //battery = acquisition_ADC(false);
                battery = 2.2;
                send_battery_voltage(&battery);
                count = 0;
            }
        }
        if (U2STAbits.UTXBF == 0 && cb_transmission.bufferLength > 0){
            pull(false);
        }

        IFS0bits.T2IF = 0;        
        T2CONbits.TON = 1;  
        tmr_wait_period(TIMER2);
    }
    return 0;
}